grevaillot/svd_tools/headers/ATSAMV71N19B/pmc.h
#define PMC_PMC_MCKR_MDIV_SHIFT		8
#define PMC_PMC_MCKR_MDIV_MASK		0x03
/** @defgroup pmc_pmc_mckr_mdiv MDIV Master Clock Division
@{*/
/**@}*/


#define PMC_PMC_MCKR_PRES_SHIFT		4
#define PMC_PMC_MCKR_PRES_MASK		0x07
/** @defgroup pmc_pmc_mckr_pres PRES Processor Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_MCKR_CSS_SHIFT		0
#define PMC_PMC_MCKR_CSS_MASK		0x03
/** @defgroup pmc_pmc_mckr_css CSS Master Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_usb PMCUSB USB Clock Register
@{*/


#define PMC_PMC_USB_USBDIV_SHIFT		8
#define PMC_PMC_USB_USBDIV_MASK		0x0f
/** @defgroup pmc_pmc_usb_usbdiv USBDIV Divider for USB_48M
@{*/
/**@}*/

/** PMC_PMC_USB_USBS USB Input Clock Selection **/
#define PMC_PMC_USB_USBS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pck[0] PMCPCK[0] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[0]_PRES_SHIFT		4
#define PMC_PMC_PCK[0]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[0]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[0]_CSS_SHIFT		0
#define PMC_PMC_PCK[0]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[0]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[1] PMCPCK[1] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[1]_PRES_SHIFT		4
#define PMC_PMC_PCK[1]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[1]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[1]_CSS_SHIFT		0
#define PMC_PMC_PCK[1]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[1]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[2] PMCPCK[2] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[2]_PRES_SHIFT		4
#define PMC_PMC_PCK[2]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[2]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[2]_CSS_SHIFT		0
#define PMC_PMC_PCK[2]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[2]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[3] PMCPCK[3] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[3]_PRES_SHIFT		4
#define PMC_PMC_PCK[3]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[3]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[3]_CSS_SHIFT		0
#define PMC_PMC_PCK[3]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[3]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[4] PMCPCK[4] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[4]_PRES_SHIFT		4
#define PMC_PMC_PCK[4]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[4]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[4]_CSS_SHIFT		0
#define PMC_PMC_PCK[4]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[4]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[5] PMCPCK[5] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[5]_PRES_SHIFT		4
#define PMC_PMC_PCK[5]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[5]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[5]_CSS_SHIFT		0
#define PMC_PMC_PCK[5]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[5]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[6] PMCPCK[6] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[6]_PRES_SHIFT		4
#define PMC_PMC_PCK[6]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[6]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[6]_CSS_SHIFT		0
#define PMC_PMC_PCK[6]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[6]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[7] PMCPCK[7] Programmable Clock Register
@{*/


#define PMC_PMC_PCK[7]_PRES_SHIFT		4
#define PMC_PMC_PCK[7]_PRES_MASK		0xff
/** @defgroup pmc_pmc_pck[7]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[7]_CSS_SHIFT		0
#define PMC_PMC_PCK[7]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[7]_css CSS Programmable Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_ier PMCIER Interrupt Enable Register
@{*/

/** PMC_PMC_IER_XT32KERR 32.768 kHz Crystal Oscillator Error Interrupt Enable **/
#define PMC_PMC_IER_XT32KERR		(1 << 21)
/** PMC_PMC_IER_CFDEV Clock Failure Detector Event Interrupt Enable **/
#define PMC_PMC_IER_CFDEV		(1 << 18)
/** PMC_PMC_IER_MOSCRCS Main RC Oscillator Status Interrupt Enable **/
#define PMC_PMC_IER_MOSCRCS		(1 << 17)
/** PMC_PMC_IER_MOSCSELS Main Clock Source Oscillator Selection Status Interrupt Enable **/
#define PMC_PMC_IER_MOSCSELS		(1 << 16)
/** PMC_PMC_IER_PCKRDY7 Programmable Clock Ready 7 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY7		(1 << 15)
/** PMC_PMC_IER_PCKRDY6 Programmable Clock Ready 6 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY6		(1 << 14)
/** PMC_PMC_IER_PCKRDY5 Programmable Clock Ready 5 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY5		(1 << 13)
/** PMC_PMC_IER_PCKRDY4 Programmable Clock Ready 4 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY4		(1 << 12)
/** PMC_PMC_IER_PCKRDY3 Programmable Clock Ready 3 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY3		(1 << 11)
/** PMC_PMC_IER_PCKRDY2 Programmable Clock Ready 2 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY2		(1 << 10)
/** PMC_PMC_IER_PCKRDY1 Programmable Clock Ready 1 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY1		(1 << 9)
/** PMC_PMC_IER_PCKRDY0 Programmable Clock Ready 0 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY0		(1 << 8)
/** PMC_PMC_IER_LOCKU UTMI PLL Lock Interrupt Enable **/
#define PMC_PMC_IER_LOCKU		(1 << 6)
/** PMC_PMC_IER_MCKRDY Master Clock Ready Interrupt Enable **/
#define PMC_PMC_IER_MCKRDY		(1 << 3)
/** PMC_PMC_IER_LOCKA PLLA Lock Interrupt Enable **/
#define PMC_PMC_IER_LOCKA		(1 << 1)
/** PMC_PMC_IER_MOSCXTS Main Crystal Oscillator Status Interrupt Enable **/
#define PMC_PMC_IER_MOSCXTS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_idr PMCIDR Interrupt Disable Register
@{*/

/** PMC_PMC_IDR_XT32KERR 32.768 kHz Crystal Oscillator Error Interrupt Disable **/
#define PMC_PMC_IDR_XT32KERR		(1 << 21)
/** PMC_PMC_IDR_CFDEV Clock Failure Detector Event Interrupt Disable **/
#define PMC_PMC_IDR_CFDEV		(1 << 18)
/** PMC_PMC_IDR_MOSCRCS Main RC Status Interrupt Disable **/
#define PMC_PMC_IDR_MOSCRCS		(1 << 17)
/** PMC_PMC_IDR_MOSCSELS Main Clock Source Oscillator Selection Status Interrupt Disable **/
#define PMC_PMC_IDR_MOSCSELS		(1 << 16)
/** PMC_PMC_IDR_PCKRDY7 Programmable Clock Ready 7 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY7		(1 << 15)
/** PMC_PMC_IDR_PCKRDY6 Programmable Clock Ready 6 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY6		(1 << 14)
/** PMC_PMC_IDR_PCKRDY5 Programmable Clock Ready 5 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY5		(1 << 13)
/** PMC_PMC_IDR_PCKRDY4 Programmable Clock Ready 4 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY4		(1 << 12)
/** PMC_PMC_IDR_PCKRDY3 Programmable Clock Ready 3 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY3		(1 << 11)
/** PMC_PMC_IDR_PCKRDY2 Programmable Clock Ready 2 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY2		(1 << 10)
/** PMC_PMC_IDR_PCKRDY1 Programmable Clock Ready 1 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY1		(1 << 9)
/** PMC_PMC_IDR_PCKRDY0 Programmable Clock Ready 0 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY0		(1 << 8)
/** PMC_PMC_IDR_LOCKU UTMI PLL Lock Interrupt Disable **/
#define PMC_PMC_IDR_LOCKU		(1 << 6)
/** PMC_PMC_IDR_MCKRDY Master Clock Ready Interrupt Disable **/
#define PMC_PMC_IDR_MCKRDY		(1 << 3)
/** PMC_PMC_IDR_LOCKA PLLA Lock Interrupt Disable **/
#define PMC_PMC_IDR_LOCKA		(1 << 1)
/** PMC_PMC_IDR_MOSCXTS Main Crystal Oscillator Status Interrupt Disable **/
#define PMC_PMC_IDR_MOSCXTS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_sr PMCSR Status Register
@{*/

/** PMC_PMC_SR_XT32KERR Slow Crystal Oscillator Error **/
#define PMC_PMC_SR_XT32KERR		(1 << 21)
/** PMC_PMC_SR_FOS Clock Failure Detector Fault Output Status **/
#define PMC_PMC_SR_FOS		(1 << 20)
/** PMC_PMC_SR_CFDS Clock Failure Detector Status **/
#define PMC_PMC_SR_CFDS		(1 << 19)
/** PMC_PMC_SR_CFDEV Clock Failure Detector Event **/
#define PMC_PMC_SR_CFDEV		(1 << 18)
/** PMC_PMC_SR_MOSCRCS Main RC Oscillator Status **/
#define PMC_PMC_SR_MOSCRCS		(1 << 17)
/** PMC_PMC_SR_MOSCSELS Main Clock Source Oscillator Selection Status **/
#define PMC_PMC_SR_MOSCSELS		(1 << 16)
/** PMC_PMC_SR_PCKRDY7 Programmable Clock Ready 7 Status **/
#define PMC_PMC_SR_PCKRDY7		(1 << 15)
/** PMC_PMC_SR_PCKRDY6 Programmable Clock Ready 6 Status **/
#define PMC_PMC_SR_PCKRDY6		(1 << 14)
/** PMC_PMC_SR_PCKRDY5 Programmable Clock Ready 5 Status **/
#define PMC_PMC_SR_PCKRDY5		(1 << 13)
/** PMC_PMC_SR_PCKRDY4 Programmable Clock Ready 4 Status **/
#define PMC_PMC_SR_PCKRDY4		(1 << 12)
/** PMC_PMC_SR_PCKRDY3 Programmable Clock Ready 3 Status **/
#define PMC_PMC_SR_PCKRDY3		(1 << 11)
/** PMC_PMC_SR_PCKRDY2 Programmable Clock Ready 2 Status **/
#define PMC_PMC_SR_PCKRDY2		(1 << 10)
/** PMC_PMC_SR_PCKRDY1 Programmable Clock Ready 1 Status **/
#define PMC_PMC_SR_PCKRDY1		(1 << 9)
/** PMC_PMC_SR_PCKRDY0 Programmable Clock Ready 0 Status **/
#define PMC_PMC_SR_PCKRDY0		(1 << 8)
/** PMC_PMC_SR_OSCSELS Slow Clock Source Oscillator Selection **/
#define PMC_PMC_SR_OSCSELS		(1 << 7)
/** PMC_PMC_SR_LOCKU UTMI PLL Lock Status **/
#define PMC_PMC_SR_LOCKU		(1 << 6)
/** PMC_PMC_SR_MCKRDY Master Clock Status **/
#define PMC_PMC_SR_MCKRDY		(1 << 3)
/** PMC_PMC_SR_LOCKA PLLA Lock Status **/
#define PMC_PMC_SR_LOCKA		(1 << 1)
/** PMC_PMC_SR_MOSCXTS Main Crystal Oscillator Status **/
#define PMC_PMC_SR_MOSCXTS		(1 << 0)

/**@}*/

