grevaillot/svd_tools/headers/ATSAMV71N19B/pmc.h
/** PMC_PMC_SLPWK_DR1_PID60 Peripheral 60 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID60		(1 << 28)
/** PMC_PMC_SLPWK_DR1_PID59 Peripheral 59 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID59		(1 << 27)
/** PMC_PMC_SLPWK_DR1_PID58 Peripheral 58 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID58		(1 << 26)
/** PMC_PMC_SLPWK_DR1_PID57 Peripheral 57 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID57		(1 << 25)
/** PMC_PMC_SLPWK_DR1_PID56 Peripheral 56 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID56		(1 << 24)
/** PMC_PMC_SLPWK_DR1_PID53 Peripheral 53 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID53		(1 << 21)
/** PMC_PMC_SLPWK_DR1_PID52 Peripheral 52 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID52		(1 << 20)
/** PMC_PMC_SLPWK_DR1_PID51 Peripheral 51 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID51		(1 << 19)
/** PMC_PMC_SLPWK_DR1_PID50 Peripheral 50 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID50		(1 << 18)
/** PMC_PMC_SLPWK_DR1_PID49 Peripheral 49 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID49		(1 << 17)
/** PMC_PMC_SLPWK_DR1_PID48 Peripheral 48 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID48		(1 << 16)
/** PMC_PMC_SLPWK_DR1_PID47 Peripheral 47 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID47		(1 << 15)
/** PMC_PMC_SLPWK_DR1_PID46 Peripheral 46 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID46		(1 << 14)
/** PMC_PMC_SLPWK_DR1_PID45 Peripheral 45 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID45		(1 << 13)
/** PMC_PMC_SLPWK_DR1_PID44 Peripheral 44 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID44		(1 << 12)
/** PMC_PMC_SLPWK_DR1_PID43 Peripheral 43 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID43		(1 << 11)
/** PMC_PMC_SLPWK_DR1_PID41 Peripheral 41 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID41		(1 << 9)
/** PMC_PMC_SLPWK_DR1_PID40 Peripheral 40 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID40		(1 << 8)
/** PMC_PMC_SLPWK_DR1_PID39 Peripheral 39 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID39		(1 << 7)
/** PMC_PMC_SLPWK_DR1_PID37 Peripheral 37 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID37		(1 << 5)
/** PMC_PMC_SLPWK_DR1_PID35 Peripheral 35 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID35		(1 << 3)
/** PMC_PMC_SLPWK_DR1_PID34 Peripheral 34 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID34		(1 << 2)
/** PMC_PMC_SLPWK_DR1_PID33 Peripheral 33 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID33		(1 << 1)
/** PMC_PMC_SLPWK_DR1_PID32 Peripheral 32 SleepWalking Disable **/
#define PMC_PMC_SLPWK_DR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_slpwk_sr1 PMCSLPWKSR1 SleepWalking Status Register 1
@{*/

/** PMC_PMC_SLPWK_SR1_PID60 Peripheral 60 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID60		(1 << 28)
/** PMC_PMC_SLPWK_SR1_PID59 Peripheral 59 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID59		(1 << 27)
/** PMC_PMC_SLPWK_SR1_PID58 Peripheral 58 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID58		(1 << 26)
/** PMC_PMC_SLPWK_SR1_PID57 Peripheral 57 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID57		(1 << 25)
/** PMC_PMC_SLPWK_SR1_PID56 Peripheral 56 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID56		(1 << 24)
/** PMC_PMC_SLPWK_SR1_PID53 Peripheral 53 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID53		(1 << 21)
/** PMC_PMC_SLPWK_SR1_PID52 Peripheral 52 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID52		(1 << 20)
/** PMC_PMC_SLPWK_SR1_PID51 Peripheral 51 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID51		(1 << 19)
/** PMC_PMC_SLPWK_SR1_PID50 Peripheral 50 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID50		(1 << 18)
/** PMC_PMC_SLPWK_SR1_PID49 Peripheral 49 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID49		(1 << 17)
/** PMC_PMC_SLPWK_SR1_PID48 Peripheral 48 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID48		(1 << 16)
/** PMC_PMC_SLPWK_SR1_PID47 Peripheral 47 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID47		(1 << 15)
/** PMC_PMC_SLPWK_SR1_PID46 Peripheral 46 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID46		(1 << 14)
/** PMC_PMC_SLPWK_SR1_PID45 Peripheral 45 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID45		(1 << 13)
/** PMC_PMC_SLPWK_SR1_PID44 Peripheral 44 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID44		(1 << 12)
/** PMC_PMC_SLPWK_SR1_PID43 Peripheral 43 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID43		(1 << 11)
/** PMC_PMC_SLPWK_SR1_PID41 Peripheral 41 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID41		(1 << 9)
/** PMC_PMC_SLPWK_SR1_PID40 Peripheral 40 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID40		(1 << 8)
/** PMC_PMC_SLPWK_SR1_PID39 Peripheral 39 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID39		(1 << 7)
/** PMC_PMC_SLPWK_SR1_PID37 Peripheral 37 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID37		(1 << 5)
/** PMC_PMC_SLPWK_SR1_PID35 Peripheral 35 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID35		(1 << 3)
/** PMC_PMC_SLPWK_SR1_PID34 Peripheral 34 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID34		(1 << 2)
/** PMC_PMC_SLPWK_SR1_PID33 Peripheral 33 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID33		(1 << 1)
/** PMC_PMC_SLPWK_SR1_PID32 Peripheral 32 SleepWalking Status **/
#define PMC_PMC_SLPWK_SR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_slpwk_asr1 PMCSLPWKASR1 SleepWalking Activity Status Register 1
@{*/

/** PMC_PMC_SLPWK_ASR1_PID60 Peripheral 60 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID60		(1 << 28)
/** PMC_PMC_SLPWK_ASR1_PID59 Peripheral 59 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID59		(1 << 27)
/** PMC_PMC_SLPWK_ASR1_PID58 Peripheral 58 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID58		(1 << 26)
/** PMC_PMC_SLPWK_ASR1_PID57 Peripheral 57 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID57		(1 << 25)
/** PMC_PMC_SLPWK_ASR1_PID56 Peripheral 56 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID56		(1 << 24)
/** PMC_PMC_SLPWK_ASR1_PID53 Peripheral 53 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID53		(1 << 21)
/** PMC_PMC_SLPWK_ASR1_PID52 Peripheral 52 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID52		(1 << 20)
/** PMC_PMC_SLPWK_ASR1_PID51 Peripheral 51 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID51		(1 << 19)
/** PMC_PMC_SLPWK_ASR1_PID50 Peripheral 50 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID50		(1 << 18)
/** PMC_PMC_SLPWK_ASR1_PID49 Peripheral 49 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID49		(1 << 17)
/** PMC_PMC_SLPWK_ASR1_PID48 Peripheral 48 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID48		(1 << 16)
/** PMC_PMC_SLPWK_ASR1_PID47 Peripheral 47 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID47		(1 << 15)
/** PMC_PMC_SLPWK_ASR1_PID46 Peripheral 46 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID46		(1 << 14)
/** PMC_PMC_SLPWK_ASR1_PID45 Peripheral 45 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID45		(1 << 13)
/** PMC_PMC_SLPWK_ASR1_PID44 Peripheral 44 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID44		(1 << 12)
/** PMC_PMC_SLPWK_ASR1_PID43 Peripheral 43 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID43		(1 << 11)
/** PMC_PMC_SLPWK_ASR1_PID41 Peripheral 41 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID41		(1 << 9)
/** PMC_PMC_SLPWK_ASR1_PID40 Peripheral 40 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID40		(1 << 8)
/** PMC_PMC_SLPWK_ASR1_PID39 Peripheral 39 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID39		(1 << 7)
/** PMC_PMC_SLPWK_ASR1_PID37 Peripheral 37 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID37		(1 << 5)
/** PMC_PMC_SLPWK_ASR1_PID35 Peripheral 35 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID35		(1 << 3)
/** PMC_PMC_SLPWK_ASR1_PID34 Peripheral 34 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID34		(1 << 2)
/** PMC_PMC_SLPWK_ASR1_PID33 Peripheral 33 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID33		(1 << 1)
/** PMC_PMC_SLPWK_ASR1_PID32 Peripheral 32 Activity Status **/
#define PMC_PMC_SLPWK_ASR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_slpwk_aipr PMCSLPWKAIPR SleepWalking Activity In Progress Register
@{*/

/** PMC_PMC_SLPWK_AIPR_AIP Activity In Progress **/
#define PMC_PMC_SLPWK_AIPR_AIP		(1 << 0)

/**@}*/
